
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 5 to change, 5 to destroy.</code></pre>

* Create
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-libra-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;mi-id&#34;]
* Update
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.sa.azurerm_storage_account.storage_account
  * module.sa.random_string.storage_account_random_string
  * module.sa.time_rotating.rotate
  * module.sa.time_static.pim_expiry
  * module.sa.time_static.pim_start


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-libra-dtu-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg"
      + name                    = "app-insights-libra-dtu-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "App Insights"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-rota-dtu-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg"
      + name                    = "app-insights-rota-dtu-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "App Insights"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["mi-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg"
      + name                    = "mi-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-cft|hmi-sds-kv-stg-cft"
        name                           = "hmi-sds-kv-stg-cft"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-crime|hmi-sds-kv-stg-crime"
        name                           = "hmi-sds-kv-stg-crime"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg|hmi-sds-kv-stg"
        name                           = "hmi-sds-kv-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-rota|hmi-sds-kv-stg-rota"
        name                           = "hmi-sds-kv-stg-rota"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-snl|hmi-sds-kv-stg-snl"
        name                           = "hmi-sds-kv-stg-snl"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be destroyed
  # (because azurerm_storage_account.storage_account is not in configuration)
  - resource "azurerm_storage_account" "storage_account" {
      - access_tier                       = "Cool" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "RAGRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "hmisastg" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://hmisastg.blob.core.windows.net/" -> null
      - primary_blob_host                 = "hmisastg.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://hmisastg.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "hmisastg.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://hmisastg.file.core.windows.net/" -> null
      - primary_file_host                 = "hmisastg.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://hmisastg.queue.core.windows.net/" -> null
      - primary_queue_host                = "hmisastg.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://hmisastg.table.core.windows.net/" -> null
      - primary_table_host                = "hmisastg.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://hmisastg.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "hmisastg.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "hmi-sharedinfra-sds-stg-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_blob_connection_string  = (sensitive value)
      - secondary_blob_endpoint           = "https://hmisastg-secondary.blob.core.windows.net/" -> null
      - secondary_blob_host               = "hmisastg-secondary.blob.core.windows.net" -> null
      - secondary_connection_string       = (sensitive value)
      - secondary_dfs_endpoint            = "https://hmisastg-secondary.dfs.core.windows.net/" -> null
      - secondary_dfs_host                = "hmisastg-secondary.dfs.core.windows.net" -> null
      - secondary_location                = "ukwest" -> null
      - secondary_queue_endpoint          = "https://hmisastg-secondary.queue.core.windows.net/" -> null
      - secondary_queue_host              = "hmisastg-secondary.queue.core.windows.net" -> null
      - secondary_table_endpoint          = "https://hmisastg-secondary.table.core.windows.net/" -> null
      - secondary_table_host              = "hmisastg-secondary.table.core.windows.net" -> null
      - secondary_web_endpoint            = "https://hmisastg-secondary.z33.web.core.windows.net/" -> null
      - secondary_web_host                = "hmisastg-secondary.z33.web.core.windows.net" -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"         = "hearings-management-interface"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
        } -> null

      - blob_properties {
          - change_feed_enabled           = true -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = true -> null

          - container_delete_retention_policy {
              - days = 7 -> null
            }

          - delete_retention_policy {
              - days = 365 -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.sa.random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "czwhre9ek4pb1ts49s29t4h8" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "czwhre9ek4pb1ts49s29t4h8" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.sa.time_rotating.rotate will be destroyed
  # (because time_rotating.rotate is not in configuration)
  - resource "time_rotating" "rotate" {
      - day              = 16 -> null
      - hour             = 13 -> null
      - id               = "2023-11-22T13:45:40Z" -> null
      - minute           = 45 -> null
      - month            = 11 -> null
      - rfc3339          = "2023-11-22T13:45:40Z" -> null
      - rotation_days    = 360 -> null
      - rotation_rfc3339 = "2024-11-16T13:45:40Z" -> null
      - second           = 40 -> null
      - unix             = 1731764740 -> null
      - year             = 2024 -> null
    }

  # module.sa.time_static.pim_expiry will be destroyed
  # (because time_static.pim_expiry is not in configuration)
  - resource "time_static" "pim_expiry" {
      - day     = 16 -> null
      - hour    = 13 -> null
      - id      = "2024-11-16T13:45:40Z" -> null
      - minute  = 45 -> null
      - month   = 11 -> null
      - rfc3339 = "2024-11-16T13:45:40Z" -> null
      - second  = 40 -> null
      - unix    = 1731764740 -> null
      - year    = 2024 -> null
    }

  # module.sa.time_static.pim_start will be destroyed
  # (because time_static.pim_start is not in configuration)
  - resource "time_static" "pim_start" {
      - day     = 22 -> null
      - hour    = 13 -> null
      - id      = "2023-11-22T13:45:40Z" -> null
      - minute  = 45 -> null
      - month   = 11 -> null
      - rfc3339 = "2023-11-22T13:45:40Z" -> null
      - second  = 40 -> null
      - unix    = 1700660740 -> null
      - year    = 2023 -> null
    }

Plan: 3 to add, 5 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":46,"Program":"tfcmt","SHA1":"","Vars":{}} -->